package homework.hw6;

public class HW_6_6 {

    /*
    Дана строка:
    I’m just 16,
    going on	17!

    (перед 17 стоит Tab, а не пробел). В принципе, это может быть ЛЮБАЯ строка,
    содержащая латинские буквы в верхнем и нижнем регистре, цифры, знаки препинания.

    Найти, сколько в этой строке заглавных букв, сколько прописных, сколько гласных,
    сколько согласных, сколько цифр, сколько знаков препинания, сколько “пробельных” символов
    (в них входят пробелы, символы табуляции, перевод строки и пр. Поищите “whitespace characters”).

    Имейте в виду, что некоторые проверки можно делать легче, чем другие. Поэкспериментируйте.
     */

    public static void main(String[] args) {






    }
}
